    // 查询行业模块信息
    allIndustrySectors = [];
    sigIndustrySectors = [];

    allIndustrySectorsValues = [];

    let industryIndex = 0;
    industrySectors = ["教育","非金属矿采选业","批发业","住宿业","研究和试验发展","医药制造业","货币金融服务","金属制品业","零售业","纺织服装、服饰业","造纸和纸制品业","专用设备制造业","酒、饮料和精制茶制造业","卫生","橡胶和塑料制品业","食品制造业","印刷和记录媒介复制业","文化艺术业","化学原料和化学制品制造业","房地产业","林业","木材加工和木、竹、藤、棕、草制品业","资本市场服务","商务服务业","软件和信息技术服务业","航空运输业","金属制品、机械和设备修理业","文教、工美、体育和娱乐用品制造业","电气机械和器材制造业","农副食品加工业","家具制造业","互联网和相关服务","租赁业","化学纤维制造业","通用设备制造业","煤炭开采和洗选业","保险业","仪器仪表制造业","体育","综合","道路运输业","非金属矿物制品业","电信、广播电视和卫星传输服务","其他金融业","装卸搬运和运输代理业","仓储业","有色金属矿采选业","建筑装饰和其他建筑业","纺织业","水上运输业","农、林、牧、渔服务业","石油加工、炼焦和核燃料加工业","新闻和出版业","邮政业","铁路运输业","皮革、毛皮、羽毛及其制品和制鞋业","科技推广和应用服务业","畜牧业","计算机、通信和其他电子设备制造业","汽车制造业","公共设施管理业","餐饮业","房屋建筑业","有色金属冶炼和压延加工业","废弃资源综合利用业","建筑安装业","铁路、船舶、航空航天和其他运输设备制造业","黑色金属矿采选业","燃气生产和供应业","机动车、电子产品和日用产品修理业","广播、电视、电影和影视录音制作业","生态保护和环境治理业","开采辅助活动","黑色金属冶炼和压延加工业","土木工程建筑业","专业技术服务业","电力、热力生产和供应业","其他制造业","石油和天然气开采业","渔业","农业","水的生产和供应业"];

    {
        sigIndustrySectors.push(industrySectors[industryIndex]);
        _jy =["sh600661","sh600730","sh603377","sh605098","sz000526","sz002607","sz002621","sz002659","sz003032","sz300192","sz300338"];
        sigIndustrySectors.push(_jy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _fjskcxy = ["sh603505","sh605086"];
        sigIndustrySectors.push(_fjskcxy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _pfy = ["sh600051","sh600058","sh600083","sh600090","sh600128","sh600153","sh600180","sh600241","sh600250","sh600278","sh600287","sh600335","sh600382","sh600387","sh600511","sh600538","sh600546","sh600605","sh600608","sh600626","sh600647","sh600648","sh600704","sh600710","sh600739","sh600751","sh600753","sh600755","sh600822","sh600829","sh600981","sh600993","sh600998","sh603003","sh603108","sh603368","sh603716","sh603970","sh900912","sh900927","sh900938","sz000019","sz000025","sz000028","sz000032","sz000034","sz000062","sz000096","sz000151","sz000159","sz000411","sz000554","sz000626","sz000632","sz000652","sz000701","sz000705","sz000829","sz000906","sz000950","sz000996","sz002091","sz002221","sz002416","sz002441","sz002462","sz002505","sz002589","sz002758","sz002788","sz002819","sz002872","sz003020","sz200019","sz200025","sz200028","sz300131","sz300184","sz300538","sz300650","sz300755","sz300937","sz300975"];
        sigIndustrySectors.push(_pfy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _zsy = ["sh600258","sh600754","sh601007","sh900934","sz000428","sz000524","sz000613","sz200613"];
        sigIndustrySectors.push(_zsy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _yjhsyfz = ["sh600645","sh600721","sh603127","sh603259","sh688133","sh688179","sh688202","sh688222","sz300149","sz300404","sz300759"];
        sigIndustrySectors.push(_yjhsyfz);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _yyzzy = ["sh688068","sz300573","sh603998","sz000919","sz002728","sh605199","sh600211","sz002435","sz002688","sz300841","sh600812","sh603387","sh688656","sz300832","sh600329","sh603976","sz300482","sz000766","sz002287","sz300108","sh688317","sz300485","sz002737","sz300519","sz002566","sz300122","sh600227","sz002219","sz300142","sh600781","sh603392","sh688526","sz000788","sz300452","sh600201","sz300583","sz000790","sh603718","sz000908","sz000650","sz300239","sh603538","sz002365","sh600771","sh603439","sh600195","sz300255","sz300086","sz002581","sz002349","sh600351","sz002550","sh605177","sh688363","sz002198","sh600530","sz000513","sh600276","sz300147","sz002433","sh600196","sz002900","sz300289","sh600568","sz000153","sz002262","sh688136","sh688399","sz002603","sh600380","sz002022","sz002107","sh600285","sh688366","sh688098","sz002038","sz002873","sz300497","sz300683","sh603566","sh600789","sz002653","sh600420","sh600436","sh600513","sh688185","sz300026","sz002030","sz002826","sz002390","sz300194","sh600299","sh688393","sz300110","sz002907","sz000952","sz000518","sz000915","sz300158","sz300381","sz002275","sh600572","sz002693","sh600750","sz300534","sh603676","sh688189","sh600252","sh603168","sz002424","sz300639","sz300878","sz300039","sz300601","sh600867","sh603139","sz002082","sh603707","sz300434","sh688658","sz300357","sh603880","sz000739","sz000756","sh600535","sz300204","sh600479","sh600129","sz300636","sz002864","sz300016","sh688505","sh600557","sh600062","sh688298","sz300181","sz002437","sh688177","sh603669","sz300267","sz300111","sz300463","sh600332","sh600267","sz300436","sh600080","sz300363","sh600671","sz000661","sz000566","sh603963","sz000538","sz002817","sh600422","sh603456","sh688520","sh688321","sz002923","sz002317","sh600613","sz000813","sz002932","sh600488","sh605116","sz300119","sh688606","sz002644","sz300966","sz002422","sh603896","sh603229","sz000999","sz000403","sz002750","sz002099","sz000590","sh600566","sh600216","sz002880","sz002898","sh600521","sz300294","sh600161","sh600056","sh603567","sz002252","sh900904","sz300501","sh603367","sh603858","sz300199","sz002393","sz300723","sz000597","sz300439","sh600222","sz300254","sh600079","sz002001","sh688180","sh688266","sh600085","sh600594","sh900917","sz002102","sz002755","sz002793","sz300685","sh603590","sz300233","sz002940","sz300705","sh688338","sh688578","sz002019","sz002399","sh688513","sz300584","sz000989","sh603222","sh603351","sz002007","sh600664","sz002020","sz000534","sz002370","sz002412","sz002332","sh688289","sz002562","sz300558","sz000623","sz002411","sz300630","sz300009","sz002773","sh600385","sh603811","sh603520","sh688336","sz002675","sz300702","sz000931","sh688221","sz300871","sh603087","sh688278","sz002294","sz000423","sz002821","sz300642","sh603658","sh688566","sh600851","sz002166","sz300942","sz002118","sh688468","sz300406","sz300006","sh688687","sh688166","sz002868","sh600518"];
        sigIndustrySectors.push(_yyzzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _hbjrfw = ["sh600000","sh600015","sh600016","sh600036","sh600139","sh600901","sh600908","sh600919","sh600926","sh600928","sh601009","sh601077","sh601128","sh601166","sh601169","sh601187","sh601229","sh601288","sh601328","sh601398","sh601577","sh601658","sh601818","sh601838","sh601860","sh601916","sh601939","sh601963","sh601988","sh601997","sh601998","sh603323","sz000001","sz002142","sz002807","sz002839","sz002936","sz002948","sz002958","sz002966"];
        sigIndustrySectors.push(_hbjrfw);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _jszpy = ["sh600114","sh600477","sh600496","sh600558","sh600615","sh600992","sh601028","sh601686","sh601700","sh601968","sh603028","sh603040","sh603112","sh603278","sh603348","sh603577","sh603626","sh603629","sh603848","sh603937","sh603969","sh603985","sh605123","sh605158","sh605268","sh605376","sh688059","sh688186","sh688308","sh688379","sh688456","sz000039","sz000055","sz000778","sz000890","sz000969","sz002026","sz002032","sz002084","sz002132","sz002135","sz002150","sz002318","sz002342","sz002403","sz002443","sz002444","sz002478","sz002487","sz002514","sz002541","sz002545","sz002547","sz002615","sz002652","sz002701","sz002722","sz002743","sz002752","sz002760","sz002787","sz002791","sz002843","sz002846","sz002850","sz002921","sz002965","sz002969","sz002976","sz003043","sz200055","sz300328","sz300345","sz300488","sz300828","sz300881","sz300885","sz300946"];
        sigIndustrySectors.push(_jszpy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _lsy = ["sh600122","sh600272","sh600280","sh600293","sh600297","sh600306","sh600327","sh600337","sh600361","sh600386","sh600628","sh600653","sh600655","sh600682","sh600693","sh600694","sh600697","sh600712","sh600713","sh600723","sh600729","sh600738","sh600774","sh600778","sh600785","sh600814","sh600824","sh600827","sh600828","sh600833","sh600838","sh600857","sh600858","sh600859","sh600861","sh600865","sh600916","sh600976","sh601010","sh601086","sh601116","sh601258","sh601366","sh601607","sh601933","sh603031","sh603101","sh603123","sh603214","sh603233","sh603353","sh603708","sh603719","sh603777","sh603883","sh603900","sh603939","sh605136","sh605188","sh605266","sh900923","sh900943","sz000026","sz000078","sz000417","sz000419","sz000501","sz000564","sz000679","sz000715","sz000753","sz000757","sz000759","sz000785","sz000851","sz000963","sz002024","sz002187","sz002251","sz002264","sz002277","sz002336","sz002356","sz002419","sz002556","sz002561","sz002640","sz002697","sz002727","sz002780","sz002999","sz200026","sz300022","sz300464","sz300622","sz300783","sz300892","sz300945"];
        sigIndustrySectors.push(_lsy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _fzfzfsy = ["sh600107","sh600137","sh600146","sh600177","sh600398","sh600400","sh601566","sh601718","sh603157","sh603196","sh603518","sh603555","sh603587","sh603808","sh603839","sh603877","sh603908","sz002003","sz002029","sz002154","sz002269","sz002291","sz002404","sz002486","sz002503","sz002563","sz002569","sz002612","sz002634","sz002656","sz002687","sz002740","sz002762","sz002763","sz002832","sz002875","sz003016","sz300005","sz300840"];
        sigIndustrySectors.push(_fzfzfsy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _zzhzzpy = ["sh600103","sh600235","sh600308","sh600356","sh600433","sh600567","sh600793","sh600963","sh600966","sh603022","sh603165","sh603607","sh603687","sh603733","sh603863","sh605007","sh605009","sh605377","sh605500","sz000488","sz000815","sz002012","sz002067","sz002078","sz002228","sz002303","sz002511","sz002521","sz002565","sz002799","sz002831","sz003006","sz200488","sz200986","sz300883"];
        sigIndustrySectors.push(_zzhzzpy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _zysbzy = ["sh600031","sh600055","sh600169","sh600184","sh600262","sh600302","sh600320","sh600343","sh600388","sh600499","sh600526","sh600528","sh600545","sh600560","sh600579","sh600582","sh600587","sh600761","sh600815","sh600817","sh600843","sh600855","sh600860","sh600879","sh600984","sh601038","sh601100","sh601106","sh601218","sh601608","sh601798","sh601908","sh603012","sh603029","sh603036","sh603076","sh603081","sh603085","sh603088","sh603095","sh603159","sh603169","sh603185","sh603203","sh603283","sh603289","sh603301","sh603308","sh603309","sh603311","sh603324","sh603337","sh603338","sh603396","sh603638","sh603656","sh603666","sh603686","sh603690","sh603789","sh603800","sh603855","sh603895","sh603901","sh603912","sh603917","sh603956","sh603960","sh603987","sh605186","sh605369","sh688001","sh688003","sh688006","sh688012","sh688013","sh688016","sh688021","sh688022","sh688028","sh688029","sh688037","sh688050","sh688085","sh688090","sh688092","sh688096","sh688101","sh688108","sh688128","sh688139","sh688155","sh688198","sh688200","sh688215","sh688218","sh688277","sh688301","sh688309","sh688310","sh688312","sh688328","sh688329","sh688335","sh688358","sh688377","sh688378","sh688389","sh688516","sh688518","sh688529","sh688551","sh688556","sh688559","sh688580","sh688607","sh688617","sh688626","sh688630","sh688633","sh688659","sh688677","sh900924","sh900947","sz000157","sz000425","sz000519","sz000528","sz000576","sz000584","sz000622","sz000680","sz000821","sz000852","sz000856","sz000925","sz002006","sz002008","sz002021","sz002031","sz002073","sz002097","sz002111","sz002164","sz002177","sz002196","sz002204","sz002209","sz002223","sz002278","sz002337","sz002353","sz002366","sz002371","sz002382","sz002430","sz002432","sz002490","sz002526","sz002535","sz002551","sz002595","sz002611","sz002613","sz002645","sz002651","sz002667","sz002690","sz002691","sz002698","sz002730","sz002757","sz002779","sz002786","sz002833","sz002837","sz002890","sz002901","sz002931","sz002950","sz002957","sz002975","sz002997","sz003036","sz300003","sz300029","sz300030","sz300049","sz300056","sz300092","sz300095","sz300099","sz300130","sz300140","sz300151","sz300171","sz300173","sz300195","sz300201","sz300206","sz300210","sz300228","sz300238","sz300246","sz300273","sz300276","sz300278","sz300281","sz300293","sz300298","sz300307","sz300314","sz300316","sz300318","sz300326","sz300334","sz300358","sz300368","sz300382","sz300385","sz300396","sz300400","sz300402","sz300410","sz300412","sz300415","sz300425","sz300442","sz300443","sz300450","sz300453","sz300457","sz300461","sz300462","sz300471","sz300472","sz300486","sz300509","sz300521","sz300526","sz300527","sz300529","sz300545","sz300549","sz300551","sz300562","sz300595","sz300604","sz300619","sz300631","sz300633","sz300653","sz300707","sz300751","sz300753","sz300757","sz300760","sz300771","sz300776","sz300786","sz300812","sz300813","sz300818","sz300823","sz300836","sz300837","sz300865","sz300869","sz300875","sz300879","sz300896","sz300902","sz300950","sz300953"];
        sigIndustrySectors.push(_zysbzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _jylhjzczzy = ["sh600059","sh600084","sh600132","sh600189","sh600197","sh600199","sh600238","sh600300","sh600365","sh600519","sh600543","sh600559","sh600573","sh600600","sh600616","sh600702","sh600779","sh600809","sh600962","sh601579","sh603156","sh603198","sh603369","sh603589","sh603711","sh603779","sh603919","sh605198","sh605337","sh605388","sz000568","sz000596","sz000729","sz000752","sz000799","sz000848","sz000858","sz000860","sz000869","sz000929","sz000995","sz002304","sz002461","sz002568","sz002646","sz200596","sz200869"];
        sigIndustrySectors.push(_jylhjzczzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _ws = ["sh600763","sh600896","sh603882","sz000150","sz000516","sz002044","sz002173","sz002524","sz300015","sz300143","sz300244","sz300347"];
        sigIndustrySectors.push(_ws);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _xjhslzpy = ["sh600143","sh600182","sh600210","sh600458","sh600469","sh601058","sh601163","sh601500","sh601966","sh603033","sh603212","sh603221","sh603266","sh603408","sh603580","sh603615","sh603655","sh603657","sh603725","sh603726","sh603806","sh603856","sh603991","sh603992","sh605255","sh688026","sh688219","sh688299","sh688386","sh688560","sh688669","sh688680","sz000509","sz000589","sz000599","sz000619","sz000659","sz000859","sz000887","sz000973","sz002014","sz002108","sz002224","sz002243","sz002263","sz002324","sz002372","sz002381","sz002395","sz002420","sz002450","sz002522","sz002585","sz002641","sz002676","sz002694","sz002735","sz002768","sz002790","sz002812","sz002825","sz002838","sz002886","sz002984","sz003011","sz003018","sz300021","sz300169","sz300180","sz300198","sz300218","sz300221","sz300230","sz300305","sz300320","sz300321","sz300325","sz300375","sz300478","sz300539","sz300547","sz300586","sz300587","sz300599","sz300644","sz300677","sz300716","sz300717","sz300731","sz300767","sz300806","sz300849","sz300868","sz300905","sz300920","sz300955","sz300980"];
        sigIndustrySectors.push(_xjhslzpy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _spzzy = ["sh600073","sh600186","sh600298","sh600305","sh600381","sh600419","sh600429","sh600597","sh600784","sh600866","sh600872","sh600873","sh600882","sh600887","sh600929","sh603020","sh603027","sh603043","sh603079","sh603288","sh603299","sh603317","sh603696","sh603697","sh603739","sh603755","sh603866","sh603886","sh605016","sh605179","sh605338","sh688089","sz000716","sz002053","sz002216","sz002329","sz002481","sz002495","sz002507","sz002570","sz002597","sz002626","sz002650","sz002661","sz002719","sz002732","sz002770","sz002820","sz002847","sz002910","sz002946","sz002956","sz300146","sz300401","sz300765","sz300791","sz300829","sz300858","sz300898","sz300908","sz300915","sz300973"];
        sigIndustrySectors.push(_spzzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _yshjlmjfzy = ["sh600836","sh601515","sh603058","sh603429","sh603499","sz000695","sz000812","sz002117","sz002191","sz002229","sz002599","sz002836","sz002951","sz003003"];
        sigIndustrySectors.push(_yshjlmjfzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _whysy = ["sh600576","sh603466","sz000673","sz000681","sz002699","sz300144","sz300413","sz300592","sz300860"];
        sigIndustrySectors.push(_whysy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _hxylhhxzpzzy = ["sh600075","sh600078","sh600091","sh600096","sh600135","sh600141","sh600160","sh600165","sh600230","sh600249","sh600273","sh600277","sh600301","sh600309","sh600315","sh600319","sh600328","sh600352","sh600367","sh600370","sh600378","sh600389","sh600409","sh600423","sh600426","sh600470","sh600486","sh600500","sh600589","sh600596","sh600610","sh600618","sh600623","sh600636","sh600691","sh600714","sh600722","sh600727","sh600731","sh600746","sh600796","sh600800","sh600844","sh600989","sh601208","sh601216","sh601568","sh601678","sh603010","sh603026","sh603041","sh603067","sh603077","sh603078","sh603086","sh603110","sh603155","sh603181","sh603188","sh603192","sh603217","sh603227","sh603260","sh603330","sh603360","sh603378","sh603379","sh603585","sh603599","sh603605","sh603630","sh603639","sh603650","sh603681","sh603683","sh603722","sh603737","sh603790","sh603810","sh603822","sh603823","sh603867","sh603879","sh603906","sh603916","sh603928","sh603931","sh603938","sh603948","sh603968","sh603977","sh603980","sh603983","sh605008","sh605166","sh605183","sh605366","sh605399","sh688106","sh688116","sh688129","sh688157","sh688199","sh688268","sh688350","sh688356","sh688357","sh688550","sh688571","sh688585","sh688639","sh900906","sh900908","sh900909","sh900921","sz000408","sz000422","sz000510","sz000523","sz000525","sz000545","sz000553","sz000565","sz000635","sz000683","sz000691","sz000707","sz000731","sz000737","sz000792","sz000818","sz000822","sz000830","sz000881","sz000893","sz000902","sz000912","sz000920","sz000930","sz000953","sz000985","sz000990","sz002002","sz002004","sz002037","sz002054","sz002057","sz002068","sz002092","sz002094","sz002096","sz002109","sz002125","sz002136","sz002145","sz002165","sz002170","sz002211","sz002215","sz002226","sz002246","sz002250","sz002258","sz002274","sz002312","sz002319","sz002326","sz002341","sz002360","sz002361","sz002386","sz002391","sz002398","sz002407","sz002408","sz002409","sz002440","sz002442","sz002455","sz002469","sz002470","sz002476","sz002496","sz002497","sz002513","sz002538","sz002539","sz002584","sz002588","sz002591","sz002601","sz002632","sz002637","sz002643","sz002648","sz002666","sz002669","sz002709","sz002734","sz002741","sz002748","sz002749","sz002753","sz002783","sz002802","sz002805","sz002809","sz002810","sz002827","sz002895","sz002909","sz002915","sz002917","sz002919","sz002942","sz002971","sz002986","sz003002","sz003017","sz003022","sz003042","sz200553","sz300019","sz300037","sz300041","sz300054","sz300067","sz300072","sz300082","sz300107","sz300109","sz300121","sz300132","sz300135","sz300174","sz300200","sz300214","sz300225","sz300236","sz300243","sz300261","sz300285","sz300387","sz300398","sz300405","sz300429","sz300437","sz300446","sz300481","sz300487","sz300505","sz300522","sz300530","sz300535","sz300537","sz300568","sz300575","sz300576","sz300596","sz300610","sz300637","sz300641","sz300655","sz300665","sz300684","sz300721","sz300725","sz300727","sz300740","sz300741","sz300758","sz300769","sz300796","sz300798","sz300801","sz300821","sz300848","sz300856","sz300886","sz300891","sz300910","sz300927","sz300957"];
        sigIndustrySectors.push(_hxylhhxzpzzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _fdcy = ["sh600185","sz000718","sh600223","sz002077","sh600696","sh600225","sz000615","sz000918","sz001914","sz002285","sz000011","sh600325","sz300917","sh600515","sz002016","sh600848","sh600376","sh600173","sh600393","sz000014","sz200011","sh600773","sz000558","sh603506","sz000517","sz000029","sh600663","sh600895","sz000631","sh600748","sz200029","sh900902","sh600639","sh600641","sz002244","sh600683","sh600708","sh600658","sh600604","sh600622","sh600675","sz000736","sh600048","sh900940","sz000031","sh600466","sh900911","sz000886","sz000006","sh600007","sz000402","sz000668","sz000069","sh600533","sh600649","sh600743","sh900955","sz000616","sz000863","sz200168","sz000961","sz000671","sz001979","sh601512","sh900928","sh600503","sz000002","sh600510","sz002146","sh900957","sh600082","sz000537","sh600266","sh600736","sh600239","sz002305","sh600657","sh601155","sz002147","sh600807","sz000926","sh600208","sh600665","sh600246","sh600684","sz002133","sz000540","sz000573","sh600383","sh600077","sz000036","sz002208","sz000656","sz000514","sz002314","sh600067","sz000042","sh900932","sz000720","sz000502","sh600064","sh600158","sz000560","sz002377","sh600162","sz000838","sz002968","sh600638","sz000797","sh600716","sh600159","sh600555","sh600606","sh601588","sh600215","sz000897","sh600565","sz000667","sh600692","sh600823","sh600340","sz000620","sh600322","sz000608","sz000909","sh600094","sz000007","sz000965","sz000732","sh600890","sh600791"];
        sigIndustrySectors.push(_fdcy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _ly = ["sh600265","sz000592","sz002200","sz002679"];
        sigIndustrySectors.push(_ly);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _mcjghmztzczpy = ["sh600076","sh600321","sh601996","sh603226","sz000910","sz002043","sz002631"];
        sigIndustrySectors.push(_mcjghmztzczpy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _zbscfw = ["sh600030","sh600061","sh600095","sh600109","sh600155","sh600369","sh600621","sh600695","sh600783","sh600837","sh600864","sh600909","sh600918","sh600958","sh600999","sh601066","sh601099","sh601108","sh601162","sh601198","sh601211","sh601236","sh601375","sh601377","sh601456","sh601555","sh601688","sh601696","sh601788","sh601878","sh601881","sh601901","sh601990","sh601995","sh603093","sh900919","sz000166","sz000617","sz000666","sz000686","sz000712","sz000728","sz000750","sz000776","sz000783","sz002500","sz002670","sz002673","sz002736","sz002797","sz002926","sz002939","sz002945","sz002961","sz300059","sz300309"];
        sigIndustrySectors.push(_zbscfw);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _swfwy = ["sh600057","sh600093","sh600113","sh600138","sh600415","sh600462","sh600790","sh600826","sh601828","sh601888","sh603117","sh603569","sh603598","sh603648","sh603682","sh603729","sh605168","sh900929","sz000038","sz000056","sz000058","sz000061","sz000796","sz000861","sz000882","sz002010","sz002027","sz002103","sz002127","sz002181","sz002183","sz002188","sz002210","sz002344","sz002400","sz002654","sz002707","sz002712","sz002769","sz002818","sz002878","sz002889","sz200056","sz200058","sz300058","sz300061","sz300063","sz300071","sz300178","sz300269","sz300280","sz300344","sz300612","sz300662","sz300688","sz300781","sz300795","sz300805","sz300947"];
        sigIndustrySectors.push(_swfwy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _rjhxxjsfwy = ["sh600131","sh600289","sh600406","sh600410","sh600446","sh600476","sh600536","sh600556","sh600570","sh600571","sh600588","sh600602","sh600654","sh600701","sh600718","sh600728","sh600756","sh600767","sh600797","sh600845","sh600850","sh600892","sh603039","sh603138","sh603189","sh603220","sh603232","sh603322","sh603383","sh603421","sh603602","sh603636","sh603869","sh603887","sh603918","sh603927","sh603990","sh605398","sh688004","sh688018","sh688023","sh688030","sh688039","sh688051","sh688058","sh688060","sh688066","sh688078","sh688083","sh688088","sh688095","sh688099","sh688109","sh688111","sh688118","sh688168","sh688188","sh688191","sh688201","sh688228","sh688229","sh688256","sh688258","sh688316","sh688318","sh688365","sh688368","sh688369","sh688500","sh688508","sh688521","sh688536","sh688555","sh688561","sh688568","sh688579","sh688588","sh688589","sh688590","sh688619","sh688682","sh688699","sh688777","sh900901","sh900926","sz000004","sz000158","sz000555","sz000638","sz000682","sz000889","sz000948","sz000971","sz000997","sz002063","sz002065","sz002093","sz002123","sz002148","sz002153","sz002195","sz002212","sz002230","sz002232","sz002253","sz002261","sz002268","sz002279","sz002280","sz002298","sz002316","sz002322","sz002331","sz002368","sz002373","sz002380","sz002401","sz002405","sz002410","sz002417","sz002421","sz002439","sz002453","sz002474","sz002544","sz002602","sz002609","sz002642","sz002649","sz002657","sz002771","sz002777","sz002908","sz002912","sz002929","sz002987","sz002990","sz003004","sz003005","sz003007","sz003029","sz300002","sz300010","sz300017","sz300020","sz300025","sz300036","sz300044","sz300047","sz300050","sz300051","sz300074","sz300075","sz300085","sz300096","sz300098","sz300150","sz300166","sz300167","sz300168","sz300170","sz300183","sz300188","sz300209","sz300212","sz300229","sz300231","sz300235","sz300245","sz300248","sz300249","sz300250","sz300253","sz300264","sz300271","sz300275","sz300277","sz300287","sz300290","sz300292","sz300297","sz300299","sz300300","sz300302","sz300311","sz300312","sz300324","sz300330","sz300333","sz300339","sz300348","sz300349","sz300350","sz300352","sz300359","sz300365","sz300366","sz300369","sz300377","sz300378","sz300379","sz300380","sz300383","sz300386","sz300399","sz300419","sz300440","sz300448","sz300451","sz300454","sz300465","sz300468","sz300469","sz300493","sz300496","sz300508","sz300513","sz300518","sz300520","sz300523","sz300525","sz300532","sz300533","sz300541","sz300542","sz300550","sz300552","sz300556","sz300559","sz300560","sz300561","sz300578","sz300579","sz300588","sz300597","sz300598","sz300603","sz300605","sz300608","sz300609","sz300613","sz300624","sz300634","sz300645","sz300659","sz300663","sz300671","sz300674","sz300678","sz300682","sz300687","sz300730","sz300738","sz300768","sz300789","sz300799","sz300810","sz300830","sz300845","sz300846","sz300851","sz300872","sz300895","sz300925","sz300935","sz300941","sz300959"];
        sigIndustrySectors.push(_rjhxxjsfwy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _hkysy = ["sh600004","sh600009","sh600029","sh600115","sh600221","sh600897","sh601021","sh601111","sh603885","sh900945","sz000089","sz000099","sz002928","sz200152"];
        sigIndustrySectors.push(_hkysy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _jszpjxhsbxly = ["sh600075","sh600078","sh600091","sh600096","sh600135","sh600141","sh600146","sh600155","sh600160","sh600226","sh600227","sh600228","sh600229","sh600230","sh600249","sh600277","sh600299","sh600301","sh600309","sh600315","sh600319","sh600328","sh600352","sh600367","sh600378","sh600389","sh600409","sh600423","sh600426","sh600470","sh600481","sh600486","sh600490","sh600538","sh600589","sh600596","sh600599","sh600618","sh600636","sh600691","sh600722","sh600727","sh600731","sh600746","sh600769","sh600803","sh600844","sh600985","sh601208","sh601216","sh601678","sh603002","sh603010","sh603020","sh603026","sh603067","sh603077","sh603113","sh603186","sh603227","sh603519","sh603599","sh603737","sh603798","sh603822","sh603928","sh603968","sh605099","sh688199","sh900908","sh900921","sz000155","sz000422","sz000510","sz000523","sz000525","sz000553","sz000565","sz000627","sz000635","sz000683","sz000707","sz000731","sz000737","sz000755","sz000782","sz000792","sz000818","sz000822","sz000830","sz000912","sz000950","sz000953","sz000985","sz002010","sz002019","sz002037","sz002053","sz002054","sz002057","sz002061","sz002068","sz002092","sz002094","sz002096","sz002109","sz002125","sz002136","sz002145","sz002165","sz002167","sz002170","sz002192","sz002211","sz002215","sz002217","sz002226","sz002246","sz002250","sz002256","sz002258","sz002274","sz002319","sz002326","sz002341","sz002360","sz002361","sz002386","sz002391","sz002407","sz002408","sz002409","sz002411","sz002440","sz002442","sz002450","sz002453","sz002455","sz002466","sz002470","sz002476","sz002496","sz002497","sz002513","sz002538","sz002539","sz002562","sz002568","sz002581","sz002584","sz002588","sz002597","sz002601","sz002632","sz002637","sz002643","sz002648","sz002666","sz002669","sz002709","sz002258","sz002274","sz002319","sz002326","sz002341","sz002360","sz002361","sz002386","sz002391","sz002407","sz002408","sz002409","sz002411","sz002440","sz002442","sz002450","sz002453","sz002455","sz002466","sz002470","sz002476","sz002496","sz002497","sz002513","sz002538","sz002539","sz002562","sz002568","sz002581","sz002584","sz002588","sz002597","sz002601","sz002632","sz002637","sz002643","sz002648","sz002666","sz002669","sz002709"];
        sigIndustrySectors.push(_jszpjxhsbxly);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _wjgmtyhylypzzy = ["sz002575","sz002301","sh603899","sh605099","sz300703","sh603398","sz002292","sz300640","sz002899","sz300329","sh605299","sz300756","sz002862","sz300651","sz002678","sz002348"];
        sigIndustrySectors.push(_wjgmtyhylypzzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _dqjxhqczzy = ["sh600089","sh600105","sh600112","sh600152","sh600192","sh600202","sh600261","sh600268","sh600290","sh600312","sh600336","sh600379","sh600468","sh600478","sh600481","sh600487","sh600520","sh600522","sh600537","sh600550","sh600577","sh600580","sh600590","sh600651","sh600690","sh600732","sh600847","sh600854","sh600869","sh600877","sh600884","sh600885","sh600973","sh600983","sh601126","sh601179","sh601311","sh601369","sh601616","sh601877","sh603015","sh603016","sh603045","sh603050","sh603063","sh603105","sh603195","sh603303","sh603331","sh603333","sh603355","sh603366","sh603486","sh603488","sh603489","sh603507","sh603515","sh603519","sh603530","sh603551","sh603579","sh603583","sh603606","sh603618","sh603659","sh603677","sh603679","sh603685","sh603701","sh603703","sh603728","sh603819","sh603829","sh603861","sh603868","sh603897","sh603988","sh605066","sh605117","sh605222","sh605277","sh605288","sh605336","sh605378","sh688063","sh688169","sh688330","sh688339","sh688390","sh688408","sh688567","sh688599","sh688611","sh688663","sh688676","sh688819","sz000049","sz000070","sz000333","sz000400","sz000521","sz000533","sz000541","sz000585","sz000651","sz000803","sz000806","sz000836","sz000921","sz000922","sz002005","sz002028","sz002035","sz002056","sz002074","sz002076","sz002090","sz002112","sz002129","sz002139","sz002141","sz002169","sz002176","sz002184","sz002218","sz002227","sz002242","sz002249","sz002260","sz002270","sz002276","sz002290","sz002300","sz002309","sz002334","sz002335","sz002339","sz002346","sz002350","sz002358","sz002364","sz002451","sz002452","sz002459","sz002471","sz002473","sz002491","sz002498","sz002508","sz002518","sz002527","sz002531","sz002533","sz002543","sz002546","sz002560","sz002576","sz002580","sz002606","sz002610","sz002614","sz002616","sz002617","sz002622","sz002638","sz002665","sz002668","sz002677","sz002684","sz002692","sz002705","sz002706","sz002723","sz002724","sz002733","sz002745","sz002759","sz002801","sz002823","sz002851","sz002860","sz002879","sz002882","sz002892","sz002922","sz002927","sz002953","sz002959","sz003021","sz003023","sz200512","sz200521","sz200541","sz300001","sz300014","sz300018","sz300032","sz300035","sz300040","sz300048","sz300062","sz300068","sz300069","sz300073","sz300105","sz300116","sz300118","sz300124","sz300125","sz300129","sz300141","sz300153","sz300207","sz300208","sz300217","sz300222","sz300247","sz300252","sz300265","sz300272","sz300274","sz300279","sz300283","sz300317","sz300340","sz300341","sz300342","sz300356","sz300376","sz300391","sz300403","sz300407","sz300423","sz300427","sz300438","sz300444","sz300447","sz300475","sz300477","sz300484","sz300490","sz300491","sz300499","sz300510","sz300569","sz300593","sz300617","sz300625","sz300626","sz300660","sz300670","sz300681","sz300693","sz300713","sz300724","sz300750","sz300763","sz300808","sz300820","sz300824","sz300827","sz300833","sz300889","sz300894","sz300911","sz300913","sz300919","sz300932","sz300933"];
        sigIndustrySectors.push(_dqjxhqczzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _nfspjgy = ["sh600127","sh600191","sh600251","sh600275","sh600438","sh600737","sh600811","sh600965","sh601952","sh603336","sh603345","sh603363","sh603517","sh603536","sh603609","sh603668","sh605077","sz000048","sz000505","sz000529","sz000639","sz000702","sz000876","sz000895","sz000911","sz000972","sz002100","sz002124","sz002157","sz002286","sz002311","sz002330","sz002385","sz002515","sz002548","sz002557","sz002567","sz002582","sz002695","sz002702","sz002726","sz002840","sz002852","sz002891","sz002991","sz003000","sz003030","sz200505","sz300138","sz300175","sz300268","sz300673","sz300999"];
        sigIndustrySectors.push(_nfspjgy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _jjzzy = ["sh603008","sh603180","sh603208","sh603313","sh603326","sh603389","sh603600","sh603610","sh603661","sh603709","sh603801","sh603816","sh603818","sh603833","sh603898","sz000663","sz002489","sz002572","sz002751","sz002853","sz300616","sz300729","sz300749"];
        sigIndustrySectors.push(_jjzzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _hlwhxgwf = ["sh600070","sh600226","sh600228","sh600242","sh600358","sh600633","sh600634","sh600640","sh600652","sh600804","sh600986","sh601360","sh603000","sh603258","sh603444","sh603533","sh603613","sh603825","sh603881","sh603888","sh688158","sz000503","sz000606","sz000676","sz000835","sz002072","sz002095","sz002113","sz002131","sz002168","sz002174","sz002235","sz002247","sz002315","sz002354","sz002425","sz002447","sz002464","sz002467","sz002517","sz002530","sz002555","sz002558","sz002605","sz002619","sz002624","sz002803","sz002995","sz003010","sz300031","sz300038","sz300043","sz300052","sz300113","sz300148","sz300226","sz300242","sz300295","sz300315","sz300343","sz300392","sz300418","sz300459","sz300467","sz300494","sz300571","sz300766","sz300773","sz300785","sz300792","sz300921"];
        sigIndustrySectors.push(_hlwhxgwf);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _zly = ["sh600830","sh603300","sz000415"];
        sigIndustrySectors.push(_zly);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _hxxwy = ["sh600063","sh600346","sh600527","sh600810","sh600889","sh601113","sh601233","sh603225","sh603332","sh688065","sz000301","sz000420","sz000677","sz000703","sz000782","sz000936","sz000949","sz002064","sz002172","sz002206","sz002254","sz002427","sz002493","sz002998","sz300699","sz300777","sz300876"];
        sigIndustrySectors.push(_hxxwy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _tysbzzy = ["sh600218","sh600243","sh600416","sh600421","sh600444","sh600592","sh600619","sh600835","sh600841","sh600875","sh600894","sh601002","sh601177","sh601615","sh601727","sh601882","sh601956","sh603011","sh603090","sh603109","sh603131","sh603187","sh603218","sh603269","sh603277","sh603279","sh603298","sh603315","sh603320","sh603321","sh603339","sh603356","sh603611","sh603617","sh603667","sh603699","sh603757","sh603915","sh603966","sh605060","sh605100","sh605286","sh605389","sh688017","sh688165","sh688333","sh688360","sh688557","sh688558","sh688577","sh688596","sh688678","sh900910","sh900920","sh900925","sz000404","sz000410","sz000530","sz000570","sz000595","sz000678","sz000777","sz000811","sz000816","sz000837","sz000880","sz000903","sz002009","sz002011","sz002046","sz002050","sz002122","sz002152","sz002158","sz002197","sz002202","sz002248","sz002255","sz002272","sz002282","sz002347","sz002367","sz002418","sz002438","sz002472","sz002480","sz002483","sz002520","sz002523","sz002529","sz002534","sz002537","sz002552","sz002553","sz002559","sz002598","sz002630","sz002633","sz002639","sz002685","sz002686","sz002689","sz002774","sz002795","sz002808","sz002816","sz002871","sz002884","sz002896","sz002903","sz002943","sz003025","sz003033","sz200530","sz200570","sz200706","sz200771","sz300004","sz300024","sz300091","sz300097","sz300126","sz300145","sz300154","sz300161","sz300185","sz300193","sz300202","sz300257","sz300260","sz300263","sz300362","sz300411","sz300420","sz300421","sz300441","sz300470","sz300473","sz300503","sz300512","sz300540","sz300607","sz300611","sz300669","sz300694","sz300718","sz300772","sz300780","sz300809","sz300817","sz300850","sz300853","sz300907","sz300931","sz300943","sz300971"];
        sigIndustrySectors.push(_tysbzzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _mtkchxxy = ["sh600121","sh600123","sh600188","sh600348","sh600395","sh600397","sh600403","sh600508","sh600758","sh600971","sh600985","sh601001","sh601088","sh601101","sh601225","sh601666","sh601699","sh601898","sh601918","sh900948","sz000552","sz000780","sz000937","sz000983","sz002128"];
        sigIndustrySectors.push(_mtkchxxy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _bxy = ["sh600291","sh601318","sh601319","sh601336","sh601601","sh601628","sz000627"];
        sigIndustrySectors.push(_bxy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _yqybzy = ["sh600071","sh601222","sh601567","sh603100","sh603297","sh603416","sh603556","sh603662","sh603700","sh688010","sh688056","sh688127","sh688160","sh688528","sh688600","sh688616","sh688628","sh688686","sh688698","sz002058","sz002121","sz002175","sz002338","sz002658","sz002747","sz002767","sz002849","sz002857","sz002877","sz002979","sz002980","sz300007","sz300066","sz300112","sz300137","sz300165","sz300203","sz300259","sz300286","sz300306","sz300354","sz300360","sz300370","sz300371","sz300417","sz300430","sz300445","sz300466","sz300480","sz300515","sz300553","sz300557","sz300567","sz300572","sz300648","sz300667","sz300720","sz300800","sz300838","sz300862","sz300880","sz300882","sz300897"];
        sigIndustrySectors.push(_yqybzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _ty = ["sz002858"];
        sigIndustrySectors.push(_ty);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _zh = ["sh600200","sh600212","sh600455","sh600603","sh600620","sh600624","sh600673","sh600770","sh600805","sz000009","sz000409","sz000532","sz000551","sz000571","sz000609","sz000833"];
        sigIndustrySectors.push(_zh);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _dlysy = ["sh600012","sh600020","sh600033","sh600035","sh600106","sh600119","sh600269","sh600350","sh600368","sh600377","sh600548","sh600561","sh600611","sh600650","sh600662","sh600676","sh600834","sh601107","sh601188","sh601518","sh603032","sh603069","sh603223","sh603813","sh900903","sh900914","sz000088","sz000429","sz000548","sz000755","sz000828","sz000885","sz000900","sz001965","sz002357","sz002627","sz002682","sz002800","sz200429"];
        sigIndustrySectors.push(_dlysy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _fjskwzy = ["sh600145","sh600172","sh600176","sh600326","sh600366","sh600425","sh600449","sh600516","sh600529","sh600539","sh600585","sh600586","sh600660","sh600668","sh600678","sh600720","sh600724","sh600801","sh600802","sh600819","sh600876","sh600881","sh600883","sh601012","sh601636","sh601865","sh601992","sh603021","sh603256","sh603268","sh603385","sh603578","sh603601","sh603612","sh603616","sh603663","sh603688","sh603826","sh603838","sh605006","sh605122","sh688077","sh688233","sh688300","sh688398","sh688598","sh900918","sh900933","sz000012","sz000023","sz000401","sz000672","sz000786","sz000789","sz000795","sz000877","sz000935","sz002066","sz002080","sz002088","sz002162","sz002201","sz002205","sz002225","sz002233","sz002271","sz002297","sz002302","sz002392","sz002457","sz002571","sz002596","sz002623","sz002671","sz002742","sz002785","sz002798","sz002918","sz003012","sz003037","sz200012","sz300064","sz300080","sz300089","sz300093","sz300160","sz300179","sz300196","sz300224","sz300234","sz300374","sz300395","sz300409","sz300554","sz300606","sz300690","sz300700","sz300715","sz300737","sz300748","sz300861","sz300890"];
        sigIndustrySectors.push(_fjskwzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _dxgbdshwxcsfw = ["sh600037","sh600050","sh600637","sh600831","sh600936","sh600959","sh600996","sh601698","sh601929","sh603559","sz000839","sz000917","sz002238","sz002359","sz300288","sz300310","sz300770"];
        sigIndustrySectors.push(_dxgbdshwxcsfw);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _qtjry = ["sh600053","sh600120","sh600318","sh600390","sh600517","sh600599","sh600643","sh600705","sh600816","sh601519","sz000046","sz000416","sz000563","sz000567","sz000958","sz000987","sz002423","sz002647","sz300023","sz300033","sz300803"];
        sigIndustrySectors.push(_qtjry);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _zxbyhysdly = ["sh600179","sh601598","sh603128","sh603329","sh603713","sh603871","sh603967","sh605050","sz002245"];
        sigIndustrySectors.push(_zxbyhysdly);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _ccy = ["sh600787","sh600794","sh603066","sh603535","sz002492","sz002711","sz002930","sz300013","sz300240","sz300873"];
        sigIndustrySectors.push(_ccy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _ysjskcxy = ["sh600259","sh600311","sh600338","sh600489","sh600497","sh600547","sh600711","sh600766","sh600988","sh601020","sh601069","sh601168","sh601899","sh601958","sh603993","sz000426","sz000506","sz000603","sz000688","sz000758","sz000975","sz002155","sz002192"];
        sigIndustrySectors.push(_ysjskcxy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _jzzshqtjzy = ["sh600193","sh600209","sh601886","sh603030","sh603098","sh603828","sh605178","sh900939","sz002047","sz002081","sz002163","sz002323","sz002325","sz002375","sz002482","sz002504","sz002620","sz002713","sz002781","sz002789","sz002811","sz002822","sz002830","sz002856","sz002963","sz002989","sz300117","sz300506","sz300621"];
        sigIndustrySectors.push(_jzzshqtjzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _fzy = ["sh600156","sh600220","sh600232","sh600448","sh600493","sh600630","sh600689","sh600987","sh601339","sh601599","sh603055","sh603238","sh603365","sh603558","sh603665","sh603889","sh605003","sh605055","sh605155","sh900922","sz000611","sz000726","sz000850","sz000955","sz000982","sz002042","sz002083","sz002087","sz002144","sz002193","sz002293","sz002327","sz002394","sz002397","sz002516","sz003041","sz200726","sz300577","sz300658","sz300819","sz300877","sz300888","sz300918","sz300952"];
        sigIndustrySectors.push(_fzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _ssysy = ["sh600017","sh600018","sh600026","sh600190","sh600279","sh600428","sh600575","sh600717","sh600798","sh601000","sh601008","sh601018","sh601228","sh601298","sh601326","sh601866","sh601872","sh601880","sh601919","sh601975","sh603167","sh603565","sh900952","sz000507","sz000520","sz000582","sz000905","sz001872","sz002040","sz002320","sz201872"];
        sigIndustrySectors.push(_ssysy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _nlmynlmy = ["sz000713"];
        sigIndustrySectors.push(_nlmynlmy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _syjgljhhrljgy = ["sh600281","sh600688","sh600725","sh600740","sh600792","sh600997","sh601011","sh601015","sh603113","sh603798","sz000059","sz000637","sz000698","sz000723","sz000819","sz002778","sz300839"];
        sigIndustrySectors.push(_syjgljhhrljgy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _xwhcbs = ["sh600229","sh600373","sh600551","sh600757","sh600825","sh600880","sh601019","sh601098","sh601801","sh601811","sh601858","sh601900","sh601928","sh601949","sh601999","sh603096","sh603999","sz000607","sz000719","sz000793","sz300364","sz300654","sz300788"];
        sigIndustrySectors.push(_xwhcbs);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _yzy = ["sh600233","sh603056","sz002120","sz002352","sz002468"];
        sigIndustrySectors.push(_yzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _tlysy = ["sh600125","sh601006","sh601333","sh601816","sz000557","sz000927"];
        sigIndustrySectors.push(_tlysy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _pgmyjqzphzxy = ["sh600439","sh600735","sh603001","sh603116","sh603557","sh603608","sh603958","sh605068","sz002494","sz002674","sz300591"];
        sigIndustrySectors.push(_pgmyjqzphzxy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _kjtghyyfwy = ["sz000504","sz003035"];
        sigIndustrySectors.push(_kjtghyyfwy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _xmy = ["sh600975","sh603477","sz000735","sz002234","sz002299","sz002321","sz002458","sz002714","sz002746","sz002982","sz300106","sz300313","sz300498","sz300761","sz300967"];
        sigIndustrySectors.push(_xmy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _txhqtdzsbzzy = ["sh600060","sh600100","sh600118","sh600130","sh600151","sh600171","sh600183","sh600198","sh600203","sh600234","sh600237","sh600260","sh600271","sh600288","sh600330","sh600345","sh600353","sh600355","sh600360","sh600363","sh600405","sh600435","sh600460","sh600485","sh600498","sh600525","sh600552","sh600562","sh600563","sh600584","sh600601","sh600666","sh600667","sh600703","sh600707","sh600734","sh600745","sh600764","sh600775","sh600776","sh600839","sh600870","sh600888","sh600898","sh600980","sh600990","sh601138","sh601231","sh601869","sh603002","sh603005","sh603019","sh603023","sh603025","sh603042","sh603068","sh603083","sh603106","sh603115","sh603118","sh603133","sh603160","sh603186","sh603228","sh603236","sh603267","sh603290","sh603327","sh603328","sh603380","sh603386","sh603390","sh603496","sh603501","sh603516","sh603528","sh603595","sh603633","sh603660","sh603678","sh603712","sh603773","sh603803","sh603890","sh603893","sh603920","sh603933","sh603936","sh603986","sh603989","sh603996","sh605058","sh605111","sh605118","sh605218","sh605258","sh605358","sh688002","sh688005","sh688007","sh688008","sh688011","sh688019","sh688020","sh688025","sh688027","sh688036","sh688055","sh688079","sh688080","sh688081","sh688086","sh688093","sh688100","sh688123","sh688126","sh688135","sh688138","sh688159","sh688181","sh688183","sh688195","sh688208","sh688260","sh688286","sh688288","sh688311","sh688313","sh688388","sh688396","sh688418","sh688519","sh688533","sh688595","sh688608","sh688609","sh688618","sh688636","sh688661","sh688662","sh688665","sh688667","sh688668","sh688683","sh688689","sh688696","sh688788","sh688981","sh900941","sz000016","sz000020","sz000021","sz000045","sz000050","sz000063","sz000066","sz000100","sz000413","sz000536","sz000547","sz000561","sz000586","sz000636","sz000670","sz000687","sz000725","sz000727","sz000733","sz000801","sz000810","sz000823","sz000938","sz000970","sz000977","sz000988","sz002017","sz002025","sz002036","sz002045","sz002049","sz002052","sz002055","sz002079","sz002089","sz002104","sz002106","sz002115","sz002119","sz002130","sz002134","sz002137","sz002138","sz002151","sz002156","sz002161","sz002179","sz002180","sz002185","sz002189","sz002194","sz002199","sz002214","sz002217","sz002222","sz002231","sz002236","sz002241","sz002273","sz002281","sz002288","sz002289","sz002296","sz002308","sz002313","sz002351","sz002362","sz002369","sz002376","sz002383","sz002384","sz002387","sz002388","sz002389","sz002396","sz002402","sz002413","sz002414","sz002415","sz002426","sz002429","sz002436","sz002446","sz002449","sz002456","sz002463","sz002465","sz002475","sz002484","sz002506","sz002512","sz002519","sz002528","sz002577","sz002579","sz002583","sz002587","sz002600","sz002618","sz002635","sz002636","sz002655","sz002660","sz002681","sz002729","sz002766","sz002782","sz002792","sz002796","sz002806","sz002813","sz002815","sz002829","sz002835","sz002841","sz002845","sz002848","sz002855","sz002859","sz002861","sz002866","sz002869","sz002876","sz002881","sz002885","sz002888","sz002897","sz002902","sz002906","sz002913","sz002916","sz002925","sz002935","sz002937","sz002938","sz002947","sz002952","sz002955","sz002960","sz002962","sz002970","sz002972","sz002977","sz002981","sz002983","sz002992","sz002993","sz003015","sz003019","sz003026","sz003028","sz003031","sz003040","sz200016","sz200020","sz200045","sz200413","sz200468","sz200725","sz300042","sz300045","sz300046","sz300053","sz300065","sz300076","sz300077","sz300078","sz300079","sz300083","sz300088","sz300101","sz300102","sz300114","sz300115","sz300120","sz300127","sz300128","sz300134","sz300136","sz300139","sz300155","sz300162","sz300177","sz300205","sz300211","sz300213","sz300219","sz300220","sz300223","sz300227","sz300232","sz300241","sz300256","sz300270","sz300282","sz300296","sz300301","sz300303","sz300308","sz300319","sz300322","sz300323","sz300327","sz300331","sz300346","sz300351","sz300353","sz300367","sz300373","sz300389","sz300390","sz300393","sz300394","sz300397","sz300408","sz300414","sz300433","sz300449","sz300455","sz300456","sz300458","sz300460","sz300474","sz300476","sz300479","sz300502","sz300504","sz300514","sz300516","sz300531","sz300543","sz300546","sz300548","sz300555","sz300563","sz300565","sz300566","sz300570","sz300581","sz300582","sz300590","sz300602","sz300615","sz300620","sz300623","sz300627","sz300628","sz300629","sz300632","sz300638","sz300647","sz300656","sz300657","sz300661","sz300666","sz300672","sz300679","sz300686","sz300689","sz300691","sz300698","sz300701","sz300708","sz300709","sz300710","sz300711","sz300726","sz300735","sz300739","sz300743","sz300747","sz300752","sz300762","sz300782","sz300787","sz300790","sz300793","sz300802","sz300807","sz300811","sz300822","sz300831","sz300835","sz300842","sz300843","sz300847","sz300852","sz300857","sz300866","sz300870","sz300884","sz300903","sz300909","sz300916","sz300936","sz300939","sz300940","sz300951","sz300956","sz300965","sz300968","sz300976"];
        sigIndustrySectors.push(_txhqtdzsbzzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _qczzy = ["sh600006","sh600066","sh600081","sh600104","sh600148","sh600166","sh600178","sh600213","sh600303","sh600375","sh600418","sh600480","sh600501","sh600523","sh600609","sh600686","sh600698","sh600699","sh600733","sh600741","sh600742","sh600933","sh600960","sh601127","sh601238","sh601279","sh601633","sh601689","sh601717","sh601777","sh601799","sh603006","sh603009","sh603013","sh603035","sh603037","sh603089","sh603121","sh603158","sh603161","sh603166","sh603178","sh603179","sh603197","sh603239","sh603286","sh603305","sh603306","sh603319","sh603335","sh603358","sh603586","sh603596","sh603730","sh603758","sh603767","sh603768","sh603786","sh603788","sh603809","sh603922","sh603926","sh603949","sh603950","sh603982","sh603997","sh605005","sh605018","sh605088","sh605128","sh605133","sh605151","sh605228","sh605333","sh900946","sh900953","sz000030","sz000338","sz000550","sz000559","sz000572","sz000581","sz000625","sz000700","sz000760","sz000800","sz000868","sz000901","sz000951","sz000957","sz000980","sz000981","sz002048","sz002085","sz002101","sz002126","sz002190","sz002213","sz002239","sz002265","sz002283","sz002284","sz002328","sz002355","sz002363","sz002406","sz002434","sz002448","sz002454","sz002488","sz002510","sz002536","sz002590","sz002592","sz002593","sz002594","sz002625","sz002662","sz002664","sz002703","sz002708","sz002715","sz002725","sz002765","sz002863","sz002865","sz002870","sz002920","sz200030","sz200550","sz200581","sz200625","sz300100","sz300176","sz300258","sz300304","sz300428","sz300432","sz300507","sz300580","sz300585","sz300643","sz300652","sz300680","sz300695","sz300733","sz300742","sz300745","sz300863","sz300893","sz300926","sz300969"];
        sigIndustrySectors.push(_qczzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _ggssgly = ["sh600054","sh600593","sh600706","sh600749","sh603099","sh603136","sh603199","sh900942","sz000430","sz000610","sz000809","sz000888","sz000978","sz002033","sz002059","sz002159","sz002485","sz002973","sz300815","sz300859"];
        sigIndustrySectors.push(_ggssgly);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _cyy = ["sh605108","sz000721","sz002186","sz002306"];
        sigIndustrySectors.push(_cyy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _fwjzy = ["sh600939","sz000628"];
        sigIndustrySectors.push(_fwjzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _ysjsylhyyjgy = ["sh600110","sh600111","sh600206","sh600219","sh600255","sh600331","sh600362","sh600392","sh600456","sh600459","sh600490","sh600531","sh600549","sh600595","sh600768","sh600961","sh601137","sh601212","sh601388","sh601600","sh601609","sh601677","sh601702","sh603399","sh603527","sh603799","sh603876","sh603978","sh605208","sh688122","sz000060","sz000612","sz000629","sz000630","sz000633","sz000657","sz000751","sz000807","sz000831","sz000878","sz000933","sz000960","sz000962","sz002114","sz002149","sz002160","sz002167","sz002171","sz002182","sz002203","sz002237","sz002240","sz002295","sz002333","sz002378","sz002379","sz002428","sz002460","sz002466","sz002501","sz002532","sz002540","sz002578","sz002716","sz002738","sz002824","sz002842","sz002988","sz003038","sz300034","sz300057","sz300337","sz300489","sz300618","sz300697","sz300855","sz300963"];
        sigIndustrySectors.push(_ysjsylhyyjgy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _fqzyzhlyy = ["sh600217","sh600614","sh688196","sh900907","sz000820","sz002340","sz002672","sz002996","sz300779","sz300930"];
        sigIndustrySectors.push(_fqzyzhlyy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _jzazy = ["sh603929"];
        sigIndustrySectors.push(_jzazy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _tlcbhkhthqtyssbzzy = ["sh600038","sh600099","sh600150","sh600316","sh600372","sh600391","sh600482","sh600495","sh600679","sh600685","sh600760","sh600765","sh600818","sh600862","sh600893","sh600967","sh601766","sh601890","sh601989","sh603111","sh603129","sh603500","sh603508","sh603680","sh603766","sh603787","sh605001","sh605298","sh688009","sh688015","sh688033","sh688070","sh688510","sh688569","sh688586","sh900915","sh900916","sz000008","sz000017","sz000697","sz000738","sz000768","sz000913","sz000976","sz001696","sz002013","sz002023","sz002105","sz002933","sz002985","sz003009","sz200017","sz200054","sz300011","sz300123","sz300159","sz300424","sz300589","sz300594","sz300600","sz300696","sz300719","sz300775","sz300900","sz300906","sz300923","sz300960"];
        sigIndustrySectors.push(_tlcbhkhthqtyssbzzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _hsjskcxy = ["sh600532","sh601969","sz000655","sz000762","sz000923","sz002978"];
        sigIndustrySectors.push(_hsjskcxy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _rqschgyy = ["sh600207","sh600333","sh600617","sh600635","sh600681","sh600803","sh600856","sh600903","sh600917","sh600956","sh601139","sh603053","sh603080","sh603318","sh603393","sh603689","sh603706","sh605169","sh605368","sh900913","sz000407","sz000421","sz000593","sz000669","sz002259","sz002267","sz002700","sz002911","sz300332","sz300435"];
        sigIndustrySectors.push(_rqschgyy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _jdcdzcphrypxly = ["sz300736"];
        sigIndustrySectors.push(_jdcdzcphrypxly);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _gbdsdyhyslyzzy = ["sh600052","sh600088","sh600136","sh600715","sh600977","sh601595","sh603103","sh603721","sz000156","sz000665","sz000802","sz000892","sz002071","sz002343","sz002445","sz002502","sz002739","sz002905","sz300027","sz300133","sz300182","sz300251","sz300291","sz300336","sz300426","sz300528"];
        sigIndustrySectors.push(_gbdsdyhyslyzzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _slhjhggssgly = ["sh600292","sh600323","sh600475","sh601200","sh601330","sh601827","sh603177","sh603200","sh603359","sh603568","sh603588","sh603603","sh603797","sh603903","sh605081","sh688057","sh688069","sh688156","sh688178","sh688466","sh688679","sz000005","sz000035","sz000546","sz000826","sz000967","sz002034","sz002266","sz002310","sz002549","sz002573","sz002717","sz002887","sz003027","sz300070","sz300103","sz300152","sz300172","sz300187","sz300190","sz300197","sz300262","sz300266","sz300355","sz300388","sz300422","sz300495","sz300664","sz300692","sz300816","sz300864","sz300867","sz300899","sz300912","sz300929","sz300948","sz300958","sz300961"];
        sigIndustrySectors.push(_slhjhggssgly);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _kcfzhd = ["sh600339","sh600583","sh600871","sh600968","sh601808","sh603619","sh603727","sh603979","sz002207","sz002554","sz002629","sz002683","sz002828","sz300084","sz300157","sz300164","sz300191"];
        sigIndustrySectors.push(_kcfzhd);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _hsjsylhyyjgy = ["sh600010","sh600019","sh600022","sh600117","sh600126","sh600231","sh600282","sh600295","sh600307","sh600399","sh600408","sh600507","sh600569","sh600581","sh600782","sh600808","sh601003","sh601005","sh603878","sh603995","sh900936","sz000708","sz000709","sz000717","sz000761","sz000825","sz000898","sz000932","sz000959","sz002075","sz002110","sz002756","sz200761"];
        sigIndustrySectors.push(_hsjsylhyyjgy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _tmgcjzy = ["sh600039","sh600068","sh600072","sh600133","sh600170","sh600248","sh600284","sh600463","sh600491","sh600502","sh600512","sh600769","sh600820","sh600846","sh600853","sh600970","sh601068","sh601117","sh601186","sh601390","sh601399","sh601611","sh601618","sh601668","sh601669","sh601789","sh601800","sh603007","sh603316","sh603388","sh603637","sh603717","sh603778","sh603815","sh603843","sh603955","sh603959","sh605303","sz000010","sz000065","sz000090","sz000498","sz000711","sz000928","sz002051","sz002060","sz002061","sz002062","sz002116","sz002140","sz002307","sz002374","sz002431","sz002542","sz002564","sz002586","sz002628","sz002663","sz002761","sz002775","sz002941","sz003001","sz300008","sz300055","sz300237","sz300517","sz300536","sz300649","sz300712"];
        sigIndustrySectors.push(_tmgcjzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _zyjsfwy = ["sh600629","sh601226","sh601965","sh603017","sh603018","sh603060","sh603126","sh603183","sh603357","sh603458","sh603698","sh603776","sh603859","sh603860","sh603909","sh688315","sz000068","sz000710","sz000779","sz002178","sz002776","sz002883","sz002949","sz002967","sz003008","sz003013","sz300012","sz300081","sz300215","sz300284","sz300384","sz300416","sz300492","sz300500","sz300564","sz300635","sz300668","sz300675","sz300676","sz300732"];
        sigIndustrySectors.push(_zyjsfwy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _dlrlrqjsschgyy = ["sh600011","sh600021","sh600023","sh600025","sh600027","sh600098","sh600101","sh600116","sh600149","sh600157","sh600163","sh600167","sh600236","sh600310","sh600396","sh600452","sh600483","sh600505","sh600509","sh600578","sh600642","sh600644","sh600674","sh600719","sh600726","sh600744","sh600780","sh600795","sh600821","sh600863","sh600868","sh600886","sh600900","sh600969","sh600979","sh600982","sh600995","sh601016","sh601619","sh601778","sh601985","sh601991","sh603693","sh900937","sz000027","sz000037","sz000040","sz000155","sz000531","sz000539","sz000543","sz000591","sz000600","sz000601","sz000690","sz000692","sz000722","sz000767","sz000791","sz000862","sz000875","sz000883","sz000899","sz000966","sz000993","sz001896","sz002015","sz002039","sz002256","sz002479","sz002499","sz002608","sz002893","sz003816","sz200037","sz200539","sz300335"];
        sigIndustrySectors.push(_dlrlrqjsschgyy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _qtzzy = ["sh600612","sh600891","sh601606","sh603038","sh603059","sh603628","sh603738","sh605318","sh688488","sh900905","sz000587","sz002098","sz002345","sz002574","sz002718","sz002721","sz002731","sz002867","sz300163","sz300706","sz300722","sz300922","sz300962"];
        sigIndustrySectors.push(_qtzzy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _syhtrqkcy = ["sh600028","sh600256","sh600759","sh600777","sh601857","sz000968","sz300483"];
        sigIndustrySectors.push(_syhtrqkcy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _yy = ["sh600097","sh600257","sh600467","sz000798","sz002069","sz002086","sz002696","sz200992","sz300094"];
        sigIndustrySectors.push(_yy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _ny = ["sh600108","sh600313","sh600354","sh600359","sh600371","sh600506","sh600540","sh600598","sh601118","sz000998","sz002041","sz002772","sz300087","sz300189","sz300511","sz300970","sz300972"];
        sigIndustrySectors.push(_ny);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];

        sigIndustrySectors.push(industrySectors[industryIndex]);
        _sdschgyy = ["sh600008","sh600168","sh600187","sh600283","sh600461","sh600874","sh601158","sh601199","sh601368","sh603759","sh603817","sz000544","sz000598","sz000605","sz000685","sz003039"];
        sigIndustrySectors.push(_sdschgyy);
        allIndustrySectors.push(sigIndustrySectors);
        industryIndex++;
        sigIndustrySectors = [];
    }


    //获取行业涨幅
    {
        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZA01.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZA02.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZA03.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZA04.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZA05.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZB06.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZB07.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZB08.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZB09.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZB10.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZB11.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC13.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC14.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC15.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC17.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC18.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC19.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC20.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC21.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC22.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC23.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC24.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC25.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC26.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC27.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC28.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC29.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC30.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC31.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC32.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC33.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC34.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC35.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC36.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC37.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC38.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC39.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC40.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC41.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC42.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZC43.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZD44.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZD45.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZD46.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZE47.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZE48.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZE49.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZE50.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZF51.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZF52.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZG53.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZG54.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZG55.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZG56.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZG58.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZG59.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZG60.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZH61.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZH62.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZI63.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZI64.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZI65.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZJ66.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZJ67.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZJ68.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZJ69.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZK70.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZL71.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZL72.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZM73.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZM74.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZM75.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZN77.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZN78.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZO80.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZP82.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZQ83.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZR85.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZR86.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZR87.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZR88.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);

        sigleIndustrySectorsValues = S_Finance_bankuai_company.hangye_ZS90.split(",");
        allIndustrySectorsValues.push(sigleIndustrySectorsValues);


    }